# import pandas

In [118]:

import pandas as pd

# pandas data structure are Series and DataFrame

In [119]:
car_model = pd.Series(['bmw','wonda','toyota'])

In [55]:
car_model

0       bmw
1     wonda
2    toyota
dtype: object

In [56]:
car_color = pd.Series(["white","black","red"])

In [57]:
car_color

0    white
1    black
2      red
dtype: object

In [58]:
car_data = pd.DataFrame({'car model':car_model,'car colour':car_color})

# call the varible

In [59]:
car_data

  car model car colour
0       bmw      white
1     wonda      black
2    toyota        red

# read the file

In [60]:
car_sales = pd.read_csv('E:\data sceince csv\car-sales.csv')

In [61]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [ ]:
car_sales.dtypes

In [63]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [64]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [65]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [66]:
car_sales.info

<bound method DataFrame.info of      Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00>

In [67]:
car_sales["Odometer (KM)"].mean()

78601.4

In [68]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [69]:
len(car_sales)

10

In [70]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [71]:
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [72]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [73]:
car_sales.tail(4)

     Make Colour  Odometer (KM)  Doors      Price
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [74]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [75]:
car_sales.shape

(10, 5)

In [76]:
car_sales.shape

(10, 5)

In [77]:
car_data.to_csv("exported car data")

In [78]:
car_sales["Doors"]

0    4
1    4
2    3
3    5
4    4
5    4
6    4
7    4
8    4
9    4
Name: Doors, dtype: int64

In [79]:
car_sales["Doors"].sum()

40

In [80]:
len(car_sales)

10

In [81]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [82]:
animals = pd.Series(["cat","dog","bird","lion","pandas"],index=[0,9,3,4,2])

In [83]:
animals

0       cat
9       dog
3      bird
4      lion
2    pandas
dtype: object

In [84]:
animals.iloc[3]

'lion'

In [85]:
animals.loc[3]

'bird'

In [86]:
animals.iloc[:3]

0     cat
9     dog
3    bird
dtype: object

In [90]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [91]:
car_sales["Price"].str.replace("[\$\,\.]",'').astype(int)

C:\Users\Fujitsu\AppData\Local\Temp\ipykernel_5400\1998817606.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  car_sales["Price"].str.replace("[\$\,\.]",'').astype(int)

0     400000
1     500000
2     700000
3    2200000
4     350000
5     450000
6     750000
7     700000
8     625000
9     970000
Name: Price, dtype: int32

In [92]:
car_sales_missing =pd.read_csv("E:\data sceince csv\car-sales-missing-data.csv")

In [93]:
car_sales_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [95]:
car_sales_missing.info

<bound method DataFrame.info of      Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700>

In [98]:
car_sales_missing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Make      9 non-null      object
 1   Colour    9 non-null      object
 2   Odometer  6 non-null      float64
 3   Doors     9 non-null      float64
 4   Price     8 non-null      object
dtypes: float64(2), object(3)
memory usage: 528.0+ bytes

In [99]:
car_sales_missing["Odometer"].mean()

92302.66666666667

In [100]:
car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean())

0    150043.000000
1     87899.000000
2     92302.666667
3     11179.000000
4    213095.000000
5     92302.666667
6     92302.666667
7     92302.666667
8     60000.000000
9     31600.000000
Name: Odometer, dtype: float64

In [101]:
car_sales_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [102]:
car_sales_missing["Odometer"] = car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean())

In [103]:
car_sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [104]:
car_sales_missing.dropna()

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

In [105]:
seats_column = pd.Series([4,4,4,4,4])

In [106]:
seats_column

0    4
1    4
2    4
3    4
4    4
dtype: int64

In [107]:
car_sales['seats'] = seats_column

In [108]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price  seats
0  Toyota  White         150043      4   $4,000.00    4.0
1   Honda    Red          87899      4   $5,000.00    4.0
2  Toyota   Blue          32549      3   $7,000.00    4.0
3     BMW  Black          11179      5  $22,000.00    4.0
4  Nissan  White         213095      4   $3,500.00    4.0
5  Toyota  Green          99213      4   $4,500.00    NaN
6   Honda   Blue          45698      4   $7,500.00    NaN
7   Honda   Blue          54738      4   $7,000.00    NaN
8  Toyota  White          60000      4   $6,250.00    NaN
9  Nissan  White          31600      4   $9,700.00    NaN

In [111]:
car_sales["seats"].fillna(4)

0    4.0
1    4.0
2    4.0
3    4.0
4    4.0
5    4.0
6    4.0
7    4.0
8    4.0
9    4.0
Name: seats, dtype: float64

In [112]:
car_sales["seats"]=car_sales["seats"].fillna(4)

In [113]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price  seats
0  Toyota  White         150043      4   $4,000.00    4.0
1   Honda    Red          87899      4   $5,000.00    4.0
2  Toyota   Blue          32549      3   $7,000.00    4.0
3     BMW  Black          11179      5  $22,000.00    4.0
4  Nissan  White         213095      4   $3,500.00    4.0
5  Toyota  Green          99213      4   $4,500.00    4.0
6   Honda   Blue          45698      4   $7,500.00    4.0
7   Honda   Blue          54738      4   $7,000.00    4.0
8  Toyota  White          60000      4   $6,250.00    4.0
9  Nissan  White          31600      4   $9,700.00    4.0

In [114]:
fuel = [90,80,50,60,30,20,50,98,67,43]

In [115]:
car_sales["fuel for 100 km"] = fuel

In [116]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price  seats  fuel for 100 km
0  Toyota  White         150043      4   $4,000.00    4.0               90
1   Honda    Red          87899      4   $5,000.00    4.0               80
2  Toyota   Blue          32549      3   $7,000.00    4.0               50
3     BMW  Black          11179      5  $22,000.00    4.0               60
4  Nissan  White         213095      4   $3,500.00    4.0               30
5  Toyota  Green          99213      4   $4,500.00    4.0               20
6   Honda   Blue          45698      4   $7,500.00    4.0               50
7   Honda   Blue          54738      4   $7,000.00    4.0               98
8  Toyota  White          60000      4   $6,250.00    4.0               67
9  Nissan  White          31600      4   $9,700.00    4.0               43